Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: ཆོས་རྣམས་ནི་མི་ཟད་པའོ་ཞེས་ཐོས་ན་འཇུག་པའོ། །དེ་ལ་ཇི་ལྟར་ན་མི་འཕྲོགས་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should those who follow the teachings on emptiness be understood in terms of not being swayed?

source: སྟོང་པ་ཉིད་སྨྲ་བ་ནི་མི་གནས་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ཀྱིས་མི་འཕྲོགས་ཏེ།
en: Followers of the teachings on emptiness are not swayed by worldly phenomena because they are without basis.

source: རྙེད་པས་དགའ་བ་ཡང་མེད་མ་རྙེད་པས་མི་དགའ་བ་ཡང་མེད།
en: They are neither excited by gain nor depressed when not getting what they want.

source: གྲགས་པས་ཡི་སོས་པ་ཡང་མེད།
en: They are neither elated by fame nor disheartened by infamy.

source: མ་གྲགས་པས་སྲོ་ཤི་བ་ཡང་མེད། སྨད་པས་ཞུམ་པ་ཡང་མེད། བསྟོད་པས་དགའ་བར་སེམས་པ་ཡང་མེད།
en: They do not cower when censured, nor delight in praise.

source: བདེ་བས་ཆགས་པར་འགྱུར་བ་ཡང་མེད། སྡུག་བསྔལ་བས་ཡིད་འབྱུང་བར་འགྱུར་བ་ཡང་མེད་དེ།
en: They are neither enamored with pleasure nor dispirited by suffering.

source: གང་དེ་ལྟར་འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ཀྱིས་མི་འཕྲོགས་པ་དེ་ནི་སྟོང་པ་ཉིད་ཤེས་པ་སྟེ།
en: Those who are not diverted by worldly phenomena have understood emptiness.

source: དེ་ལྟར་མི་འཕྲོགས་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how those who follow the teachings on emptiness should be understood in terms of not being swayed.

source: ཇི་ལྟར་ན་རྣམ་པར་མི་འགྲོ་བས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should those who follow the teachings on emptiness be understood in terms of not moving?

source: སྟོང་པ་ཉིད་སྨྲ་བ་ནི་གང་ནས་ཀྱང་རྣམ་པར་མི་འགྲོ། གང་དུ་ཡང་རྣམ་པར་མི་འགྲོ། །
en: Followers of the teachings on emptiness do not move from somewhere or to somewhere.

source: དེ་གང་ནས་རྣམ་པར་འགྲོ་བ་དང་། གང་དུ་རྣམ་པར་འགྲོ་བ་དེ་སྟོང་པ་ཉིད་དུ་མཐོང་།
en: That which moves from somewhere to somewhere is seen to be and known as emptiness.

source: སྟོང་པ་ཉིད་དུ་ཤེས་སོ། །གང་མི་འགྲོ་རྣམ་པར་མི་འགྲོ་བ་དེ་ཡང་སྟོང་པ་ཉིད་དུ་ཤེས་ཏེ།
en: That which does not go, which does not move, is also understood as emptiness.

source: དེ་ལྟར་རྣམ་པར་མི་འགྲོ་བས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how those who follow the teachings on emptiness should be understood in terms of not moving.

source: ཇི་ལྟར་ན་ཆགས་པ་མེད་ཅིང་ཆགས་པ་དང་བྲལ་བ་ཡང་མ་ཡིན་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should those who follow the teachings on emptiness be understood in terms of being neither attached nor free from attachment?

source: སྟོང་པ་ཉིད་སྨྲ་བ་ནི་གང་དུ་ཡང་ཆགས་པའམ།
en: Followers of the teachings on emptiness are not attached to anything and are not devoid of attachment.

source: མི་ཆགས་པ་མེད་དེ། དེ་གང་ལ་ཆགས་པ་དང་གང་ལ་མི་ཆགས་པ་དེ་སྟོང་པ་ཉིད་དུ་ཤེས། སྟོང་པ་ཉིད་དུ་མཐོང་ཞིང་།
en: That to which one either is attached or is free from attachment is known and seen to be emptiness.

source: གང་ཆོས་གང་ལ་ཆགས་པ་དང་། ཆགས་པ་མེད་པ་དེ་ཡང་སྟོང་པ་ཉིད་དུ་ཤེས་ཏེ།
en: The one who is either attached or free from attachment to some phenomena is also seen as emptiness.

source: དེ་ལྟར་ཆགས་པ་མེད་ཅིང་ཆགས་པ་དང་བྲལ་བ་ཡང་མ་ཡིན་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how those who follow the teachings on emptiness should be understood in terms of neither being attached nor being free from attachment.

source: དེ་ལ་ཇི་ལྟར་ན་འཇུག་པ་མེད་ཅིང་ལྡོག་པ་མེད་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should those who follow the teachings on emptiness be understood in terms of not accepting or rejecting?

source: སྟོང་པ་ཉིད་སྨྲ་བ་ནི་གང་དུ་ཡང་མི་འཇུག །གང་ནས་ཀྱང་མི་ལྡོག་སྟེ།
en: Followers of the teachings on emptiness do not accept anything and do not reject anything.

source: དེ་གང་ལ་འཇུག་པ་དང་། གང་ནས་ཀྱང་ལྡོག་པ་དེ་སྟོང་པ་ཉིད་དུ་ཤེས། སྟོང་པ་ཉིད་དུ་མཐོང་ཡང་བྱང་ཆུབ་ཀྱི་ཚོགས་རྣམས་ལ་མི་འཇུག་པ་ཡང་མ་ཡིན་ཏེ།
en: That which is accepted and rejected is known and seen as emptiness, but one does not reject the requisites for awakening.

source: གང་དེ་ལྟར་འཇུག་པ་དེ་ནི་སྟོང་པ་ཉིད་ཤེས་པ་ཡིན་ཏེ།
en: Whatever is thus accepted is known as emptiness.

source: དེ་ལྟར་འཇུག་པ་མེད་ཅིང་ལྡོག་པ་མེད་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how those who follow the teachings on emptiness should be understood in terms of not accepting or rejecting.

source: ཇི་ལྟར་ན་འཐབ་པ་མེད་ཅིང་རྩོད་པ་མེད་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should those who follow the teachings on emptiness be understood in terms of not fighting and arguing?

source: གང་ལ་ལ་འཐབ་ཅིང་རྩོད་པར་བྱེད་པ་དེས་ནི་སྟོང་པ་ཉིད་མི་ཤེས་ཏེ།
en: Whoever fights and argues does not know emptiness.

source: དེ་གང་དང་འཐབ་ཅིང་རྩོད་པར་བྱེད་པ་དེ་སྟོང་པ་ཉིད་དུ་ཤེས། སྟོང་པ་ཉིད་དུ་མཐོང་སྟེ།
en: Those with whom they fight and argue are known and seen as emptiness.

source: དེ་ལྟར་འཐབ་པ་མེད་ཅིང་རྩོད་པ་མེད་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how those who follow the teachings on emptiness should be understood in terms of not fighting and arguing.

source: ཇི་ལྟར་ན་བྲི་བ་མེད་ཅིང་གང་བ་མེད་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should those who follow the teachings on emptiness be understood in terms of neither decreasing nor increasing?

source: སྟོང་པ་ཉིད་སྨྲ་བ་ནི་ཆོས་གང་ཡང་བྲི་བའམ་གང་བར་མི་མཐོང་སྟེ།
en: Followers of the teachings on emptiness are not seen to decrease or increase any phenomenon.

source: དེས་ཆོས་གང་སྟོང་པ་དེ་བྲི་བའམ་འཕེལ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: They do not observe any empty phenomenon either decreasing or expanding.

source: སུ་ཆོས་གང་འབྲི་བའམ་འཕེལ་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་དེ་ནི་སྟོང་པ་ཉིད་ཤེས་པ་མ་ཡིན་ཏེ།
en: Those who observe a phenomenon decreasing or expanding do not know emptiness.

source: དེ་ལྟར་བྲི་བ་མེད་ཅིང་གང་བ་མེད་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how those who follow the teachings on emptiness should be understood in terms of neither decreasing nor increasing.

source: ཇི་ལྟར་ན་འདུ་བྱེད་ཐམས་ཅད་རང་བཞིན་གྱིས་འགགས་པར་བཟོད་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should those who follow the teachings on emptiness be understood in terms of tolerating the natural cessation of all formations?

source: སྟོང་པ་ཉིད་སྨྲ་བ་ནི་ཆོས་ཡང་དག་པའམ། ཡང་དག་པ་མ་ཡིན་པར་ཡང་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: Followers of the teachings on emptiness do not recognize phenomena as real or unreal.

source: གང་ཡང་དག་པ་ཡང་མ་ཡིན། ཡང་དག་པ་མ་ཡིན་པ་ཡང་མ་ཡིན་པ་དེ་ནི་ངོ་བོ་ཉིད་ཀྱིས་འགགས་པའོ། །
en: That which is neither real nor unreal has fundamentally ceased.

source: གང་ངོ་བོ་ཉིད་ཀྱིས་འགགས་པ་དེ་ནི་རང་བཞིན་གྱིས་འགགས་པ་ཞེས་བྱའོ། །
en: That which has fundamentally ceased has naturally ceased.

source: སྟོང་པ་ཉིད་སྨྲ་བ་ནི་ཆོས་གང་ཡང་སྐྱེ་བའམ། འགགས་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: Followers of the teachings on emptiness are correct in not recognizing phenomena as being born or having ceased.

source: དེ་ལྟར་འདུ་བྱེད་ཐམས་ཅད་རང་བཞིན་གྱིས་འགགས་པར་བཟོད་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: That is how one should understand those who follow the teachings on emptiness in terms of tolerating the natural cessation of all formations.

source: དེ་ལ་ཇི་ལྟར་ན་ཆོས་གང་ཡང་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་མ་བསྐྱེད། སངས་རྒྱས་རྣམས་ཀྱིས་མ་བཀག་ཅེས་ཐོས་ན་མི་སྐྲག་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should those who follow the teachings on emptiness be understood in terms of not being afraid when hearing, ‘Nothing is ever produced by ordinary people nor is brought to an end by the buddhas’?

source: སྟོང་པ་ཉིད་སྨྲ་བ་ནི་འདི་ལྟར་འདི་དག་ནི་སོ་སོའི་སྐྱེ་བོ་འདི་དག་ནི་སངས་རྒྱས་སོ་སྙམ་དུ་མི་སེམས་མོད་ཀྱི། སངས་རྒྱས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་ཀྱིས་སོ་སོའི་སྐྱེ་བོའི་ཆོས་མཉམ་པ་ཉིད་དུ་ཤེས་སོ། །
en: Followers of the teachings on emptiness do not think, ‘These are ordinary people and those are buddhas,’ but they do know the uniformity of ordinary peoples’ qualities in terms of the uniformity of the buddhas’ qualities.

source: གང་སོ་སོའི་སྐྱེ་བོའི་ཆོས་ནི་ཐ་མ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་རྒྱ་ཆེ་བར་མཐོང་བ་དེ་ནི་སྟོང་པ་ཉིད་ཤེས་པ་མ་ཡིན་ཏེ།
en: Those who regard the ways of ordinary beings as inferior and the qualities of the buddhas to be vast do not know emptiness.

source: དེ་ལྟར་ཆོས་གང་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་མ་བསྐྱེད། སངས་རྒྱས་རྣམས་ཀྱིས་མ་བཀག་ཅེས་ཐོས་ན་མི་སྐྲག་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how those who follow the teachings on emptiness should be understood in terms of not being afraid when hearing, ‘Nothing is ever produced by ordinary people nor is brought to an end by the buddhas.’

source: ཇི་ལྟར་ན་འཁོར་བའི་རང་བཞིན་དང་མྱ་ངན་ལས་འདས་པའི་རང་བཞིན་དེ་དག་མཚུངས་སོ་ཞེས་ཐོས་ན་ཐེ་ཚོམ་མི་ཟ་བས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should those who follow the teachings on emptiness be understood in terms of not being consumed with doubt when hearing, ‘The nature of saṃsāra and the nature of nirvāṇa are the same’?

source: གང་འཁོར་བའི་རང་བཞིན་དང་མྱ་ངན་ལས་འདས་པའི་རང་བཞིན་ཐ་དད་པར་མཐོང་བ་དེ་ནི་སྟོང་པ་ཉིད་ཤེས་པ་མ་ཡིན་ནོ། །
en: Those who see a difference between the nature of saṃsāra and the nature of nirvāṇa do not know emptiness.

source: འདི་ལྟ་སྟེ། འཁོར་བའི་དེ་བཞིན་ཉིད་དང་མྱ་ངན་ལས་འདས་པའི་དེ་བཞིན་ཉིད་དེ་གཉི་ག་ཡང་འདུས་མ་བྱས་ཀྱི་མཚན་ཉིད་དུ་མཚན་ཉིད་གཅིག་སྟེ།
en: The suchness of both saṃsāra and nirvāṇa share the same characteristic of being uncompounded.

source: གང་འདི་ལྟར་འཁོར་བའི་དེ་བཞིན་ཉིད་དང་། མྱ་ངན་ལས་འདས་པའི་དེ་བཞིན་ཉིད་མཚུངས་ཤིང་བྱེ་བྲག་མེད་པར་མཐོང་བ་ནི་ཐེ་ཚོམ་མི་ཟ་སྟེ།
en: Those who recognize this equivalence in the suchness of saṃsāra and nirvāṇa, that there is no difference between them, have no doubts.

source: དེ་ལྟར་འཁོར་བའི་རང་བཞིན་དང་མྱ་ངན་ལས་འདས་པའི་རང་བཞིན་དེ་དག་མཚུངས་སོ་ཞེས་ཐོས་ན་ཐེ་ཚོམ་མི་ཟ་བས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: This is how those who follow the teachings on emptiness should be understood in terms of not being consumed with doubt when hearing, ‘The nature of saṃsāra and the nature of nirvāṇa are the same.’

source: ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་རྟག་པ་ཆོས་རྣམས་ནི་མི་ཟད་པའོ་ཞེས་ཐོས་ན་འཇུག་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: “How should those who follow the teachings on emptiness be understood in terms of their engagement upon hearing ‘the body of the Thus-Gone One is permanent and its qualities are inexhaustible’?

source: གང་དེ་བཞིན་གཤེགས་པའི་སྐུ་རྟག་པ་མི་ཟད་པ་ཞེས་ཐོས་ན་མི་འཇུག་པ་དེ་ནི་སྟོང་པ་ཉིད་ཤེས་པ་མ་ཡིན་ནོ། །
en: Those who do not engage upon hearing ‘the body of the Thus-Gone One is permanent and inexhaustible’ do not know emptiness.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་དེ་བཞིན་ཉིད་དང་སྟོང་པ་ཉིད་དོ། །
en: The Thus-Gone One’s body is suchness and emptiness.

source: གློ་བུར་གྱི་ཉོན་མོངས་པ་དང་ཉེ་བའི་ཉོན་མོངས་པའི་སྐུ་མ་ཡིན་ནོ། །
en: It is not a body with adventitious afflictive emotions and secondary afflictive emotions.

source: གང་དེ་དེ་ལྟར་ཤེས་པ་དེ་ནི་སྟོང་པ་ཉིད་ཤེས་པ་སྟེ།
en: Those who know this know emptiness.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་རྟག་པ། ཆོས་རྣམས་ནི་མི་ཟད་པ་ཞེས་ཐོས་ན་འཇུག་པས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: This is how those who follow the teachings on emptiness should be understood in terms of their engagement upon hearing ‘the body of the Thus-Gone One is permanent and its qualities are inexhaustible.’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུ་པོ་དེ་དག་གིས་སྟོང་པ་ཉིད་སྨྲ་བ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: “Child of good family, bodhisattvas should understand those who follow the teachings on emptiness through these ten approaches to the way of the Dharma.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུས་ཆོས་སྨྲ་བ་པོ་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: “Child of good family, bodhisattvas should understand those who follow the Dharma through ten approaches to the way of the Dharma.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མང་དུ་ཐོས་པ་དང་། ཐོས་པ་འཛིན་པ་དང་། ཐོས་པ་རྒྱ་མཚོ་དང་། ཐོས་པ་བསགས་པ་ཡང་ཡིན་ལ་ཐོས་པ་དེས་མཐོ་བར་ཡང་མི་སེམས། དམའ་བར་ཡང་མི་སེམས་པ་དང་། དོན་དང་། ཆོས་དང་། ངེས་པའི་ཚིག་དང་། སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་ཡང་ཡིན་ལ་ཐོས་པ་ཡོངས་སུ་ཚོལ་བའི་བརྩོན་འགྲུས་ཀྱང་མི་ཉམས་པ་དང་། དུས་ཤེས་པ་དང་། ཚོད་ཤེས་པ་དང་། སྨན་ཤེས་པ་དང་། ཆོས་ཤེས་པ་དང་། དོན་ཤེས་པ་ཡང་ཡིན་ལ་རྒན་པ་རྣམས་ལ་བསྟེན་པར་ཡང་མི་འདོར་བ་དང་། བསྟན་བཅོས་ཤེས་པ་དང་དེ་ཁོ་ན་ཤེས་པ་དང་། འདུལ་བ་ཤེས་པ་ཡང་ཡིན་ལ་གཞན་ལ་འདྲི་བའི་སྦྱོར་བ་ཡང་མི་གཏོང་བ་དང་མགུ་སླ་བ་དང་གསོ་སླ་བ་དང་། ཆོ་ག་དང་སྤྱོད་པ་མཛེས་པ་ཕུན་སུམ་ཚོགས་པ་ཡང་ཡིན་ལ། བླ་མ་ལ་རིམ་གྲོ་བྱེད་པའི་སྤྱོད་པ་ཡང་མི་གཏོང་བ་དང་། དུལ་བ་དང་། ཞི་བ་དང་། བྱང་བ་དང་། མི་འཇིགས་པ་ཡང་ཡིན་ལ་ཁྲེལ་ཡོད་པ་དང་། ངོ་ཚ་ཤེས་པའི་སྦྱོར་བ་ཡང་མི་གཏོང་བ་དང་།
en: What are these ten?

source: ཟབ་པ་དང་གཏིང་དཔག་དཀའ་བའི་དོན་ལ་མཁས་པ་ཡང་ཡིན་ལ་འཇིག་རྟེན་གྱི་འཇུག་པ་རགས་ཤིང་སླ་བ་ལ་ཡང་འཇུག་པ་དང་། སེམས་ཅན་དང་འཐུན་པར་བྱ་བའི་ཕྱིར་རང་བཞིན་གྱིས་དྲང་བ་དང་། མཉེན་པ་དང་འགྲོགས་ན་བདེ་བ་ཡང་ཡིན་ལ་སེམས་ཅན་སྡང་བ་དང་རབ་ཏུ་སྡང་བ་དང་། ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་ཡང་མི་གནས་པ་དང་སྦྱིན་པ་དང་དུལ་བ་དང་མི་འགྱུར་བ་དང་། དེས་པ་དང་ཆོ་ག་དང་། གནས་པ་ལ་མངོན་པར་དགའ་བ་ཡང་ཡིན་ལ་ཐམས་ཅད་དུ་ཡང་ཡིད་མི་གནས་པ་དང་སྤྱོད་ཡུལ་ཡང་རྣམ་པར་མི་རྟོག་པ་དང་བག་ལ་ཉལ་བ་དང་། ཀུན་ནས་དཀྲིས་པ་དང་མདུད་པ་དང་།
en: (1) They do not consider themselves to be superior or inferior even though they have learned a lot, retained what they learned, have an ocean of learning, and have amassed learning; (2) they are proficient in meaning, phenomena, language, and confident eloquence, but never tire in their pursuit of learning; (3) they know about time, distance, medicine, phenomena, and meaning, but do not neglect service to their elders; (4) they have textual and practical knowledge and know the Vinaya, but do not give up the practice of posing questions to others; (5) they are easily contented, easily satisfied, and splendidly elegant in their formal behavior and their conduct, but never forsake respectful service to their master; (6) they are disciplined, peaceful, pure, and fearless, but do not stop cultivating propriety and conscientiousness; (7) they are learned in the meaning that is profound and difficult to fathom, but still pursue worldly engagements both complex and simple; (8) they take pleasure in being naturally honest, gentle, and companionable in order to maintain harmony with beings, but do not remain among beings who are hostile, hateful, and have poor discipline; (9) they delight in generosity, and being tame, constant, gentle, ritually observant, and stable, but their mind is never fixed, and they never form concepts about their experiences; and (10) they have removed their latent impressions, entanglements, knots, and thorns, but do not give up striving to eliminate the afflictive emotions of other beings.

source: ཟུག་རྔུ་འབྱིན་པ་ཡང་ཡིན་ལ་སེམས་ཅན་གཞན་གྱི་ཉོན་མོངས་པ་དག་སྤོང་བའི་བརྩོན་འགྲུས་ཀྱང་མི་གཏོང་བ་སྟེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུ་པོ་དེ་དག་གིས་ཆོས་སྨྲ་བ་པོ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: Child of good family, bodhisattvas should understand those who follow the Dharma through these ten approaches to the way of the Dharma.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུས་ཆོས་སྨྲ་བ་པོ་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: “Bodhisattvas should understand those who follow the Dharma through an additional ten approaches to the way of the Dharma.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འདོད་པ་ཐམས་ཅད་དང་བྲལ་བ་ཡང་ཡིན་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ལ་བརྩོན་འགྲུས་ཀྱང་ཉམས་པར་མི་བྱེད་པ་དང་། ཆོས་རྣམས་མི་འཕོ་བར་ཡང་ཤེས་ལ་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་བརྩོན་འགྲུས་ཀྱང་ཉམས་པར་མི་བྱེད་པ་དང་། མི་ཟད་པའི་ཆོས་མངོན་སུམ་དུ་གྱུར་པ་ཡང་ཡིན་ལ་བཟོད་པ་དང་དེས་པ་ཡང་ཉམས་པར་མི་བྱེད་པ་དང་། རྟག་ཏུ་ཏིང་ངེ་འཛིན་སྤྱོད་ཡུལ་བ་ཡང་ཡིན་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བ་བྱ་བའི་རྩོམ་པ་ཡང་ཉམས་པར་མི་བྱེད་པ་དང་། ཞི་བ་དང་ཉེ་བར་ཞི་བ་ལ་སྤྱོད་ཡུལ་བ་ཡང་ཡིན་ལ་རྣམ་པར་གཡེངས་ཏེ་སེམས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་རབ་ཏུ་བརྩོན་པ་ཡང་ཉམས་པར་མི་བྱེད་པ་དང་།
en: What are these ten?

source: གཟུངས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་ཡང་ཡིན་ལ་ཐོས་པ་ཚོལ་བའི་བརྩོན་འགྲུས་ཀྱང་ཉམས་པར་མི་བྱེད་པ་དང་། ཆོས་ཀྱི་གཏེར་ཡང་ཡིན་ལ་ལེགས་པར་བརྗོད་པ་གཅིག་གི་ཕྱིར་དཔག་ཚད་བརྒྱ་སྟོང་དུ་འགྲོ་བའི་བརྩོན་འགྲུས་ཀྱང་ཉམས་པར་མི་བྱེད་པ་དང་། ཆོས་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཡང་ཡིན་ལ་སློབ་དཔོན་དང་བླ་མ་ཚོལ་བའི་བརྩོན་འགྲུས་ཀྱང་ཉམས་པར་མི་བྱེད་པ་དང་། ཆོས་ཐམས་ཅད་མ་སྐྱེས་མ་འགགས་པ་ལ་ཐེ་ཚོམ་མེད་པ་ཡང་ཡིན་ལ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའི་བརྩོན་འགྲུས་ཀྱང་ཉམས་པར་མི་བྱེད་པ་དང་། སེམས་ཅན་དང་སེམས་ཅན་དུ་བཏགས་པ་ཡང་མི་དམིགས་ལ།
en: (1) They are free of all desire, but do not slacken in their effort to acquire the requisites of a bodhisattva; (2) they know that phenomena never transmigrate, but do not slacken in their effort to give up all possessions; (3) they directly realize the inexhaustible Dharma, but do not let their patience or gentleness diminish; (4) they are constantly immersed in samādhi, but do not slacken in their encouragement of all beings’ virtuous activity; (5) they are immersed in peace and tranquility, but do not slacken in their effort to ripen beings who are distracted and make misjudgments; (6) they have attained dhāraṇī and correct discernment, but do not slacken in their effort to learn; (7) they are a treasury of Dharma, but do not slacken in their effort to traverse hundreds of thousands of yojanas for the sake of a single eloquent expression; (8) they do not depend on the kindness of others for anything, but do not slacken in their effort to seek out a teacher and mentor; (9) they have no doubt that phenomena are not born and do not cease, but they do not slacken in their effort to uphold the sublime Dharma; and (10) they do not conceptually fixate on beings or those conceptually designated as beings, but they do not slacken in their effort to understand the awakening of a buddha.

source: སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་བརྩོན་འགྲུས་ཀྱང་ཉམས་པར་མི་བྱེད་པ་སྟེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུ་པོ་དེ་དག་གིས་ཆོས་སྨྲ་བ་པོ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: Child of good family, bodhisattvas should understand those who follow the Dharma through these ten approaches to the way of the Dharma.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུས་ཆོས་སྨྲ་བ་པོ་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: “Child of good family, bodhisattvas should understand those who follow the Dharma through an additional ten approaches to the way of the Dharma.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྦྱིན་པ་དང་། སྙན་པར་སྨྲ་བ་དང་། དོན་སྤྱོད་པ་དང་། དོན་འཐུན་པར་བྱེད་པས་དེའི་ཚིག་གཟུང་བ་ཡིན། བྱམས་པ་ཆེན་པོས་བསྐྱེད་པས་དེའི་ཚིག་འཇམ་པ་ཡིན། དབེན་པའི་རྗེས་སུ་འཐུན་ཞིང་འདོད་ཆགས་མེད་པའི་རྗེས་སུ་འཐུན་ལ་ཐར་པའི་རྗེས་སུ་འཐུན་པས་དེའི་ཚིག་རྗེས་སུ་འཐུན་པ་ཡིན། ཞི་གནས་དང་འཐུན་ཞིང་ལྷག་མཐོང་དང་འཐུན་ལ་ལམ་དང་འཐུན་པས་དེའི་ཚིག་འཐུན་པ་ཡིན། གསང་བ་རྣམ་པར་འབྱེད་པས་དེའི་ཚིག་གསལ་བ་ཡིན།
en: What are these ten?

source: སྒྲ་ངན་པ་མེད་པ་དང་དོན་རྫོགས་པས་དེའི་ཚིག་གི་དོན་དང་ཡི་གེ་མི་འདོར་བ་དང་ལྡན་པ་ཡིན། གཏི་མུག་གི་མུན་པ་དང་འཁྲུལ་པ་རྣམ་པར་འཇོམས་པས་དེའི་ཚིག་གཡོ་དང་སྒྱུ་མེད་པ་ཡིན། ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་གྱུར་པའི་རྒྱུ་ལས་བྱུང་བས་དེའི་ཚིག་ཐེ་ཚོམ་མེད་པ་ཡིན། ཉོན་མོངས་པ་དང་ཉེ་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བའི་རྒྱུ་ལས་བྱུང་བས་དེའི་ཚིག་བག་ལ་ཉལ་མེད་པ་ཡིན། དྲི་མ་མེད་ཅིང་རྩོམ་པ་མེད་པས་དེའི་ཚིག་ཀུན་ནས་ལྡང་བ་མེད་པ་ཡིན་ཏེ།
en: (1) They hold to their words through generosity, speaking kindly, acting benevolently, and being aligned in word and deed; (2) their words are gentle because they are produced with great love; (3) their words are appropriate because they align with solitude, a lack of attachment, and liberation; (4) their words are in alignment because they are in alignment with meditative calm, meditative insight, and the path; (5) their words are illuminating because they reveal secrets; (6) their words are not lacking in meaning or style because they are not unpleasant and their meaning is complete; (7) their words are neither deceptive nor deceitful because they destroy confusion and the darkness of delusion; (8) their words are free of doubts because they result from the direct perception of all phenomena; (9) their words are free of latent impressions because they result from the abandonment of the afflictive emotions and secondary afflictive emotions; and (10) their words are untroubled because they are unblemished and without instigation.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུ་པོ་དེ་དག་གིས་ཆོས་སྨྲ་བ་པོ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: Child of good family, bodhisattvas should understand those who follow the Dharma through these ten approaches to the way of the Dharma.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དེའི་ཆོས་སྟོན་པ་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་ལ་རྟེན་པ་ཡིན་གྱི། རྙེད་པ་དང་བཀུར་སྟི་ལ་རྟེན་པ་མ་ཡིན་པ་དང་། དེའི་ཆོས་སྟོན་པ་སངས་རྒྱས་ཐམས་ཅད་ལ་རྟེན་པ་ཡིན་གྱི། རང་དགའ་ལ་རྟེན་པ་མ་ཡིན་པ་དང་། དེའི་ཆོས་སྟོན་པ་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་རྩ་བ་ཅན་ཡིན་གྱི། ཉོན་མོངས་པ་དང་ཉེ་བའི་ཉོན་མོངས་པའི་རྩ་བ་ཅན་མ་ཡིན་པ་དང་། དེའི་ཆོས་སྟོན་པ་སོ་སོའི་སྐྱེ་བོའི་རྒྱུན་གཅོད་པ་ཡིན་གྱི། སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་གྱི་ཚུལ་གཅོད་པ་མ་ཡིན་པ་དང་། དེའི་ཆོས་སྟོན་པ་སྙིང་རྗེ་ཆེན་པོའི་རླན་གྱིས་བརླན་པ་ཡིན་གྱི། བདག་བདེ་བའི་རླན་གྱིས་བརླན་པ་མ་ཡིན་པ་དང་། དེའི་ཆོས་སྟོན་པ་སྟོང་པ་ཉིད་དང་།
en: What are these ten?

source: མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་ལ་ངེས་པར་རྟོགས་པས་ཟབ་པ་དང་། དེའི་ཆོས་སྟོན་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་དང་འཐུན་པས་སྐྱེ་བོ་དགེ་བ་རྣམས་དང་འཐུན་པ་དང་། དེའི་ཆོས་སྟོན་པ་ཕུང་པོ་དང་འཆི་བདག་དང་། ཉོན་མོངས་པ་དང་ལྷའི་བུ་ཚར་གཅོད་པས་བདུད་ཐམས་ཅད་རྣམ་པར་འཇོམས་པ་དང་། དེའི་ཆོས་སྟོན་པ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཆོད་པར་འོས་པས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དང་།
en: (1) The Dharma they teach is based on their mastery of the sublime Dharma, not on gain and respect; (2) the Dharma they teach is based on all the buddhas, not their own whim; (3) the Dharma they teach is rooted in great love and great compassion, not in the afflictive emotions and secondary afflictive emotions; (4) the Dharma they teach disrupts the continuity of ordinary people, not the way of the Buddha, Dharma, and Saṅgha; (5) the Dharma they teach is moistened by the water of great compassion, and not by the water of their own happiness; (6) the Dharma they teach is profound because of the realization of emptiness, signlessness, and wishlessness; (7) the Dharma they teach is aligned with virtuous people because it is aligned with the turning of the wheel of Dharma; (8) the Dharma they teach defeats all māras because it disrupts the māras of the aggregates, the lord of death, the afflictive emotions, and the divine māra; (9) the Dharma they teach reaches the seat of awakening because it is worthy of being worshiped by the whole world; and (10) the Dharma they teach accords with omniscient wisdom because it leads to the attainment of strength, fearlessness, and the unique qualities of a buddha.

source: དེའི་ཆོས་སྟོན་པ་སྟོབས་དང་། མི་འཇིགས་པ་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཐོབ་པར་བྱེད་པས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འགྲོ་བ་ཡིན་ཏེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུ་པོ་དེ་དག་གིས་ཆོས་སྨྲ་བ་པོ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: Child of good family, bodhisattvas should understand those who follow the Dharma through these ten approaches to the way of the Dharma.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཚངས་པར་སྤྱོད་པའི་ཡོ་བྱད་ལ་དགའ་བ་ཡིན་གྱི། འཇིག་རྟེན་པའི་ཡོ་བྱད་ལ་དགའ་བ་མ་ཡིན་པ་དང་། འཕགས་པའི་སྐྱེ་བོའི་ཚུལ་ལ་མངོན་པར་དགའ་བ་ཡིན་གྱི། འཕགས་པ་མ་ཡིན་པའི་སྐྱེ་བོའི་ཚུལ་ལ་དགའ་བ་མ་ཡིན་པ་དང་། འཕགས་པ་མ་ཡིན་པའི་སྐྱེ་བོ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་དགའ་བ་ཡིན་གྱི། བྱ་བ་མ་ཡིན་པ་དང་། བྱ་བ་ངན་པ་ལ་དགའ་བ་མ་ཡིན་པ་དང་། ཆོས་ཀྱི་ཟས་ལ་མངོན་པར་དགའ་བ་ཡིན་གྱི། ཟང་ཟིང་གི་ཟས་ལ་མངོན་པར་དགའ་བ་མ་ཡིན་པ་དང་། དགོན་པ་དང་བས་མཐའ་ལ་མངོན་པར་དགའ་བ་ཡིན་གྱི།
en: What are these ten?
